espressif/esp-dl/esp-dl/vision/image/isa/esp32p4/dl_esp32p4_color_common.S
#include "sdkconfig.h"
#include "esp_idf_version.h"

#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 5, 2))
.macro vldbc_8_ip q, a, n
    esp.vldbc.8.ip \q, \a, \n * 4
.endm

.macro vldbc_16_ip q, a, n
    esp.vldbc.16.ip \q, \a, \n * 2
.endm
#else
.macro vldbc_8_ip q, a, n
    esp.vldbc.8.ip \q, \a, \n
.endm

.macro vldbc_16_ip q, a, n
    esp.vldbc.16.ip \q, \a, \n
.endm
#endif

.extern vsl_8_1
.extern vsl_8_2
.extern vsl_8_3
.extern vsl_8_4
.extern vsl_8_5
.extern vsl_8_6
.extern vsl_8_7
.extern vsr_u8_1_mask
.extern vsr_u8_2_mask
.extern vsr_u8_3_mask
.extern vsr_u8_4_mask
.extern vsr_u8_5_mask
.extern vsr_u8_6_mask
.extern vsr_u8_7_mask
.extern vsl_16_1
.extern vsl_16_2
.extern vsl_16_3
.extern vsl_16_4
.extern vsl_16_5
.extern vsl_16_6
.extern vsl_16_7
.extern vsl_16_8
.extern vsl_16_9
.extern vsl_16_10
.extern vsl_16_11
.extern vsl_16_12
.extern vsl_16_13
.extern vsl_16_14
.extern vsl_16_15
.extern rgb5652rgb888_mask_tab
.extern rgb8882rgb565_mask_tab
.extern rgb8882gray_const_tab
.extern hsv_round_delta
.extern hsv_h_range

.macro vsl_8 qd, qs, q_tmp, a_tmp, n
    .if \n == 1
        la \a_tmp, vsl_8_1
    .elseif \n == 2
        la \a_tmp, vsl_8_2
    .elseif \n == 3
        la \a_tmp, vsl_8_3
    .elseif \n == 4
        la \a_tmp, vsl_8_4
    .elseif \n == 5
        la \a_tmp, vsl_8_5
    .elseif \n == 6
        la \a_tmp, vsl_8_6
    .elseif \n == 7
        la \a_tmp, vsl_8_7
    .else
        .error "unsupported n"
    .endif
    esp.vldbc.8.ip \q_tmp, \a_tmp, 0
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 5, 2))
    esp.vsld.8 \qd, \qs, \q_tmp
#else
    esp.vsld.8 \qd, \qs, \q_tmp, trunc
#endif
.endm

.macro vsl_16 qd, qs, q_tmp, a_tmp, n
    .if \n == 1
        la \a_tmp, vsl_16_1
    .elseif \n == 2
        la \a_tmp, vsl_16_2
    .elseif \n == 3
        la \a_tmp, vsl_16_3
    .elseif \n == 4
        la \a_tmp, vsl_16_4
    .elseif \n == 5
        la \a_tmp, vsl_16_5
    .elseif \n == 6
        la \a_tmp, vsl_16_6
    .elseif \n == 7
        la \a_tmp, vsl_16_7
    .elseif \n == 8
        la \a_tmp, vsl_16_8
    .elseif \n == 9
        la \a_tmp, vsl_16_9
    .elseif \n == 10
        la \a_tmp, vsl_16_10
    .elseif \n == 11
        la \a_tmp, vsl_16_11
    .elseif \n == 12
        la \a_tmp, vsl_16_12
    .elseif \n == 13
        la \a_tmp, vsl_16_13
    .elseif \n == 14
        la \a_tmp, vsl_16_14
    .elseif \n == 15
        la \a_tmp, vsl_16_15
    .else
        .error "unsupported n"
    .endif
    esp.vldbc.16.ip \q_tmp, \a_tmp, 0
    esp.vsld.16 \qd, \qs, \q_tmp
.endm

.macro vsr_u8 qd, qs, q_tmp, a_tmp, n
    .if \n == 1
        la \a_tmp, vsr_u8_1_mask
    .elseif \n == 2
        la \a_tmp, vsr_u8_2_mask
    .elseif \n == 3
        la \a_tmp, vsr_u8_3_mask
    .elseif \n == 4
        la \a_tmp, vsr_u8_4_mask
    .elseif \n == 5
        la \a_tmp, vsr_u8_5_mask
    .elseif \n == 6
        la \a_tmp, vsr_u8_6_mask
    .elseif \n == 7
        la \a_tmp, vsr_u8_7_mask
    .else
        .error "unsupported n"
    .endif
    esp.vldbc.8.ip \q_tmp, \a_tmp, 0
    li \a_tmp, \n
    esp.movx.w.sar \a_tmp
    esp.vsr.u32 \qd, \qs
    esp.andq \qd, \qd, \q_tmp
.endm

.macro vlut_32_8 qd0, qd1, q_idx, a_lut
    esp.ldxq.32 \qd0, \q_idx, \a_lut, 0, 0
    esp.ldxq.32 \qd0, \q_idx, \a_lut, 1, 1
    esp.ldxq.32 \qd0, \q_idx, \a_lut, 2, 2
    esp.ldxq.32 \qd0, \q_idx, \a_lut, 3, 3
    esp.ldxq.32 \qd1, \q_idx, \a_lut, 0, 4
    esp.ldxq.32 \qd1, \q_idx, \a_lut, 1, 5
    esp.ldxq.32 \qd1, \q_idx, \a_lut, 2, 6
    esp.ldxq.32 \qd1, \q_idx, \a_lut, 3, 7
.endm

.macro vlut_16_8 qd, q_idx_8, a_lut, q_tmp
    vlut_32_8 \qd, \q_tmp, \q_idx_8, \a_lut
    esp.vunzip.16 \qd, \q_tmp
.endm

.macro vlut_16_16 qd0, qd1, q_idx_16, a_lut, q_tmp0, q_tmp1
    esp.vext.u8 \q_tmp0, \q_tmp1, \q_idx_16
    vlut_32_8 \qd0, \qd1, \q_tmp0, \a_lut
    esp.vunzip.16 \qd0, \qd1
    vlut_32_8 \qd1, \q_tmp0, \q_tmp1, \a_lut
    esp.vunzip.16 \qd1, \q_tmp0
.endm

.macro vlut_16_16_ip qd0, qd1, q_idx_16, a_lut, q_tmp0, q_tmp1, imm
    vlut_16_16 \qd0, \qd1, \q_idx_16, \a_lut, \q_tmp0, \q_tmp1
    addi \a_lut, \a_lut, \imm
.endm

.macro vlut_8_16 qd, q_idx_16, a_lut, q_tmp0, q_tmp1, q_tmp2
    vlut_16_16 \qd, \q_tmp0, \q_idx_16, \a_lut, \q_tmp1, \q_tmp2
    esp.vunzip.8 \qd, \q_tmp0
.endm

.macro vlut_8_16_ip qd, q_idx_16, a_lut, q_tmp0, q_tmp1, q_tmp2, imm
    vlut_8_16 \qd, \q_idx_16, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2
    addi \a_lut, \a_lut, \imm
.endm

.macro norm_quant_1chn_8 q0, a_lut, q_tmp0, q_tmp1, q_tmp2
    vlut_8_16 \q0, \q0, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2
.endm

.macro norm_quant_1chn_16 qd0, qd1_qs0, a_lut, q_tmp0, q_tmp1
    vlut_16_16 \qd0, \qd1_qs0, \qd1_qs0, \a_lut, \q_tmp0, \q_tmp1
.endm

.macro norm_quant_3chn_8 q0, q1, q2, a_lut, q_tmp0, q_tmp1, q_tmp2
    vlut_8_16_ip \q0, \q0, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2, 1024
    vlut_8_16_ip \q1, \q1, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2, 1024
    vlut_8_16_ip \q2, \q2, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2, -2048
.endm

.macro norm_quant_3chn_16 qd0, qd1, qd2, qd3_qs0, qd4_qs1, qd5_qs2, a_lut, q_tmp0, q_tmp1
    vlut_16_16_ip \qd0, \qd1, \qd3_qs0, \a_lut, \q_tmp0, \q_tmp1, 1024
    vlut_16_16_ip \qd2, \qd3_qs0, \qd4_qs1, \a_lut, \q_tmp0, \q_tmp1, 1024
    vlut_16_16_ip \qd4_qs1, \qd5_qs2, \qd5_qs2, \a_lut, \q_tmp0, \q_tmp1, -2048
.endm

.macro rgb5652rgb888 qd0, qd1, qd2, qs0, qs1, a_tmp0, a_tmp1
    la \a_tmp0, rgb5652rgb888_mask_tab
    vldbc_8_ip \qd0, \a_tmp0, 2
    esp.andq \qd0, \qs0, \qd0
    vsr_u8 \qd0, \qd0, \qd1, \a_tmp1, 3

    vsl_8 \qd1, \qs1, \qd2, \a_tmp1, 5
    esp.vadd.u8 \qd1, \qd0, \qd1

    vsl_8 \qd2, \qs0, \qd0, \a_tmp1, 3

    vldbc_8_ip \qd0, \a_tmp0, 0
    esp.andq \qd0, \qs1, \qd0
.endm

.macro rgb565le2rgb888 qd0, qd1, qd2, qs0, qs1, a_tmp0, a_tmp1
    rgb5652rgb888 \qd0, \qd1, \qd2, \qs0, \qs1, \a_tmp0, \a_tmp1
.endm

.macro rgb565be2rgb888 qd0, qd1, qd2, qs0, qs1, a_tmp0, a_tmp1
    rgb5652rgb888 \qd0, \qd1, \qd2, \qs1, \qs0, \a_tmp0, \a_tmp1
.endm

.macro rgb565le2bgr888 qd0, qd1, qd2, qs0, qs1, a_tmp0, a_tmp1
    rgb5652rgb888 \qd2, \qd1, \qd0, \qs0, \qs1, \a_tmp0, \a_tmp1
.endm

.macro rgb565be2bgr888 qd0, qd1, qd2, qs0, qs1, a_tmp0, a_tmp1
    rgb5652rgb888 \qd2, \qd1, \qd0, \qs1, \qs0, \a_tmp0, \a_tmp1
.endm

.macro rgb565le2rgb888_qint8 qd0, qd1, qd2, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp
    rgb565le2rgb888 \qd0, \qd1, \qd2, \qs0, \qs1, \a_tmp0, \a_tmp1
    norm_quant_3chn_8 \qd0, \qd1, \qd2, \a_lut, \qs0, \qs1, \q_tmp
.endm

.macro rgb565be2rgb888_qint8 qd0, qd1, qd2, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp
    rgb565be2rgb888 \qd0, \qd1, \qd2, \qs0, \qs1, \a_tmp0, \a_tmp1
    norm_quant_3chn_8 \qd0, \qd1, \qd2, \a_lut, \qs0, \qs1, \q_tmp
.endm

