espressif/esp-dl/esp-dl/vision/image/isa/esp32p4/dl_esp32p4_color_common.S
.macro rgb565le2bgr888_qint8 qd0, qd1, qd2, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp
    rgb565le2bgr888 \qd0, \qd1, \qd2, \qs0, \qs1, \a_tmp0, \a_tmp1
    norm_quant_3chn_8 \qd0, \qd1, \qd2, \a_lut, \qs0, \qs1, \q_tmp
.endm

.macro rgb565be2bgr888_qint8 qd0, qd1, qd2, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp
    rgb565be2bgr888 \qd0, \qd1, \qd2, \qs0, \qs1, \a_tmp0, \a_tmp1
    norm_quant_3chn_8 \qd0, \qd1, \qd2, \a_lut, \qs0, \qs1, \q_tmp
.endm

.macro rgb565le2rgb888_qint16 qd0, qd1, qd2, qd3, qd4, qd5, a_lut, qs0, qs1, a_tmp0, a_tmp1
    rgb565le2rgb888 \qd3, \qd4, \qd5, \qs0, \qs1, \a_tmp0, \a_tmp1
    norm_quant_3chn_16 \qd0, \qd1, \qd2, \qd3, \qd4, \qd5, \a_lut, \qs0, \qs1
.endm

.macro rgb565be2rgb888_qint16 qd0, qd1, qd2, qd3, qd4, qd5, a_lut, qs0, qs1, a_tmp0, a_tmp1
    rgb565be2rgb888 \qd3, \qd4, \qd5, \qs0, \qs1, \a_tmp0, \a_tmp1
    norm_quant_3chn_16 \qd0, \qd1, \qd2, \qd3, \qd4, \qd5, \a_lut, \qs0, \qs1
.endm

.macro rgb565le2bgr888_qint16 qd0, qd1, qd2, qd3, qd4, qd5, a_lut, qs0, qs1, a_tmp0, a_tmp1
    rgb565le2bgr888 \qd3, \qd4, \qd5, \qs0, \qs1, \a_tmp0, \a_tmp1
    norm_quant_3chn_16 \qd0, \qd1, \qd2, \qd3, \qd4, \qd5, \a_lut, \qs0, \qs1
.endm

.macro rgb565be2bgr888_qint16 qd0, qd1, qd2, qd3, qd4, qd5, a_lut, qs0, qs1, a_tmp0, a_tmp1
    rgb565be2bgr888 \qd3, \qd4, \qd5, \qs0, \qs1, \a_tmp0, \a_tmp1
    norm_quant_3chn_16 \qd0, \qd1, \qd2, \qd3, \qd4, \qd5, \a_lut, \qs0, \qs1
.endm

.macro rgb8882rgb565 qd0, qd1, qs0, qs1, qs2, a_tmp0, a_tmp1
    la \a_tmp0, rgb8882rgb565_mask_tab
    vldbc_8_ip \qd0, \a_tmp0, 1
    esp.andq \qs0, \qs0, \qd0
    vsr_u8 \qs2, \qs2, \qd0, \a_tmp1, 3

    vldbc_8_ip \qd0, \a_tmp0, 1
    esp.andq \qd0, \qs1, \qd0
    vsl_8 \qd0, \qd0, \qd1, \a_tmp1, 3
    esp.vadd.u8 \qd0, \qd0, \qs2

    vldbc_8_ip \qd1, \a_tmp0, 0
    esp.andq \qd1, \qs1, \qd1
    vsr_u8 \qd1, \qd1, \qs1, \a_tmp1, 5
    esp.vadd.u8 \qd1, \qd1, \qs0
.endm

.macro rgb8882rgb565le qd0, qd1, qs0, qs1, qs2, a_tmp0, a_tmp1
    rgb8882rgb565 \qd0, \qd1, \qs0, \qs1, \qs2, \a_tmp0, \a_tmp1
.endm

.macro bgr8882rgb565le qd0, qd1, qs0, qs1, qs2, a_tmp0, a_tmp1
    rgb8882rgb565 \qd0, \qd1, \qs2, \qs1, \qs0, \a_tmp0, \a_tmp1
.endm

.macro rgb8882rgb565be qd0, qd1, qs0, qs1, qs2, a_tmp0, a_tmp1
    rgb8882rgb565 \qd1, \qd0, \qs0, \qs1, \qs2, \a_tmp0, \a_tmp1
.endm

.macro bgr8882rgb565be qd0, qd1, qs0, qs1, qs2, a_tmp0, a_tmp1
    rgb8882rgb565 \qd1, \qd0, \qs2, \qs1, \qs0, \a_tmp0, \a_tmp1
.endm

.macro rgb8882gray qd, qs0, qs1, qs2, a_tmp, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    la \a_tmp, rgb8882gray_const_tab
    esp.ldqa.u16.128.ip \a_tmp, 16

    vldbc_16_ip \q_tmp0, \a_tmp, 2
    vldbc_16_ip \q_tmp1, \a_tmp, 2
    vldbc_16_ip \q_tmp2, \a_tmp, 2
    vldbc_16_ip \q_tmp3, \a_tmp, -22

    esp.vext.u8 \qd, \qs0, \qs0
    esp.vmulas.u16.qacc \qd, \q_tmp0
    esp.vext.u8 \qd, \qs1, \qs1
    esp.vmulas.u16.qacc \qd, \q_tmp1
    esp.vext.u8 \qd, \qs2, \qs2
    esp.vmulas.u16.qacc \qd, \q_tmp2
    esp.srcmb.u16.q.qacc \qd, \q_tmp3, 0

    esp.ldqa.u16.128.ip \a_tmp, 0
    esp.vmulas.u16.qacc \qs0, \q_tmp0
    esp.vmulas.u16.qacc \qs1, \q_tmp1
    esp.vmulas.u16.qacc \qs2, \q_tmp2
    esp.srcmb.u16.q.qacc \qs0, \q_tmp3, 0

    esp.vunzip.8 \qd, \qs0
.endm

.macro bgr8882gray qd, qs0, qs1, qs2, a_tmp, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    rgb8882gray \qd, \qs2, \qs1, \qs0, \a_tmp, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
.endm

.macro rgb8882gray_qint8 qd, a_lut, qs0, qs1, qs2, a_tmp, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    rgb8882gray \qd, \qs0, \qs1, \qs2, \a_tmp, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
    norm_quant_1chn_8 \qd, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2
.endm

.macro bgr8882gray_qint8 qd, a_lut, qs0, qs1, qs2, a_tmp, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    bgr8882gray \qd, \qs0, \qs1, \qs2, \a_tmp, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
    norm_quant_1chn_8 \qd, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2
.endm

.macro rgb8882gray_qint16 qd0, qd1, a_lut, qs0, qs1, qs2, a_tmp, q_tmp0, q_tmp1, q_tmp2
    rgb8882gray \qd1, \qs0, \qs1, \qs2, \a_tmp, \qd0, \q_tmp0, \q_tmp1, \q_tmp2
    norm_quant_1chn_16 \qd0, \qd1, \a_lut, \q_tmp0, \q_tmp1
.endm

.macro bgr8882gray_qint16 qd0, qd1, a_lut, qs0, qs1, qs2, a_tmp, q_tmp0, q_tmp1, q_tmp2
    bgr8882gray \qd1, \qs0, \qs1, \qs2, \a_tmp, \qd0, \q_tmp0, \q_tmp1, \q_tmp2
    norm_quant_1chn_16 \qd0, \qd1, \a_lut, \q_tmp0, \q_tmp1
.endm

.macro rgb565le2gray qd, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb5652rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882gray \qd, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

.macro rgb565be2gray qd, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565le2gray \qd, \qs1, \qs0, \a_tmp0, \a_tmp1, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3, \q_tmp4
.endm

.macro bgr565le2gray qd, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb5652rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882gray \qd, \q_tmp2, \q_tmp1, \q_tmp0, \a_tmp0, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

.macro bgr565be2gray qd, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    bgr565le2gray \qd, \qs1, \qs0, \a_tmp0, \a_tmp1, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3, \q_tmp4
.endm

.macro rgb565le2gray_qint8 qd, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565le2gray \qd, \qs0, \qs1, \a_tmp0, \a_tmp1, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3, \q_tmp4
    norm_quant_1chn_8 \qd, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2
.endm

.macro rgb565be2gray_qint8 qd, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565be2gray \qd, \qs0, \qs1, \a_tmp0, \a_tmp1, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3, \q_tmp4
    norm_quant_1chn_8 \qd, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2
.endm

.macro bgr565le2gray_qint8 qd, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    bgr565le2gray \qd, \qs0, \qs1, \a_tmp0, \a_tmp1, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3, \q_tmp4
    norm_quant_1chn_8 \qd, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2
.endm

.macro bgr565be2gray_qint8 qd, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    bgr565be2gray \qd, \qs0, \qs1, \a_tmp0, \a_tmp1, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3, \q_tmp4
    norm_quant_1chn_8 \qd, \a_lut, \q_tmp0, \q_tmp1, \q_tmp2
.endm

.macro rgb565le2gray_qint16 qd0, qd1, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    rgb565le2gray \qd1, \qs0, \qs1, \a_tmp0, \a_tmp1, \qd0, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
    norm_quant_1chn_16 \qd0, \qd1, \a_lut, \q_tmp0, \q_tmp1
.endm

.macro rgb565be2gray_qint16 qd0, qd1, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    rgb565be2gray \qd1, \qs0, \qs1, \a_tmp0, \a_tmp1, \qd0, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
    norm_quant_1chn_16 \qd0, \qd1, \a_lut, \q_tmp0, \q_tmp1
.endm

.macro bgr565le2gray_qint16 qd0, qd1, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    bgr565le2gray \qd1, \qs0, \qs1, \a_tmp0, \a_tmp1, \qd0, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
    norm_quant_1chn_16 \qd0, \qd1, \a_lut, \q_tmp0, \q_tmp1
.endm

.macro bgr565be2gray_qint16 qd0, qd1, a_lut, qs0, qs1, a_tmp0, a_tmp1, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    bgr565be2gray \qd1, \qs0, \qs1, \a_tmp0, \a_tmp1, \qd0, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
    norm_quant_1chn_16 \qd0, \qd1, \a_lut, \q_tmp0, \q_tmp1
.endm

.macro rgb5652bgr565 qd0, qd1, qs0, qs1, a_tmp0, a_tmp1
    la \a_tmp0, rgb5652rgb888_mask_tab
    vldbc_8_ip \qd0, \a_tmp0, 1
    esp.andq \qd0, \qs0, \qd0
    vsl_8 \qs0, \qs0, \qd1, \a_tmp1, 3
    vldbc_8_ip \qd1, \a_tmp0, 0
    esp.andq \qd1, \qs1, \qd1
    esp.vadd.u8 \qd1, \qd1, \qs0
    vsr_u8 \qs1, \qs1, \qs0, \a_tmp1, 3
    esp.vadd.u8 \qd0, \qd0, \qs1
.endm

.macro rgb565le2bgr565le qd0, qd1, qs0, qs1, a_tmp0, a_tmp1
    rgb5652bgr565 \qd0 \qd1 \qs0 \qs1 \a_tmp0 \a_tmp1
.endm

