espressif/esp-dl/esp-dl/vision/image/isa/esp32p4/dl_esp32p4_color_common.S
.macro rgb565be2bgr565be qd0, qd1, qs0, qs1, a_tmp0, a_tmp1
    rgb5652bgr565 \qd1 \qd0 \qs1 \qs0 \a_tmp0 \a_tmp1
.endm

.macro rgb565le2bgr565be qd0, qd1, qs0, qs1, a_tmp0, a_tmp1
    rgb5652bgr565 \qd1 \qd0 \qs0 \qs1 \a_tmp0 \a_tmp1
.endm

.macro rgb565be2bgr565le qd0, qd1, qs0, qs1, a_tmp0, a_tmp1
    rgb5652bgr565 \qd0 \qd1 \qs1 \qs0 \a_tmp0 \a_tmp1
.endm

.macro mul_u32xu8_round_and_shift qd, q_u32, q_u8, q_round_delta, a_tmp0, a_tmp1, sel4_q_u8
    esp.movi.32.a \q_u32, \a_tmp0, 0
    esp.movi.8.a \q_u8, \a_tmp1, 0 + 4 * \sel4_q_u8
    mul \a_tmp0, \a_tmp0, \a_tmp1
    esp.movi.32.q \qd, \a_tmp0, 0

    esp.movi.32.a \q_u32, \a_tmp0, 1
    esp.movi.8.a \q_u8, \a_tmp1, 1 + 4 * \sel4_q_u8
    mul \a_tmp0, \a_tmp0, \a_tmp1
    esp.movi.32.q \qd, \a_tmp0, 1

    esp.movi.32.a \q_u32, \a_tmp0, 2
    esp.movi.8.a \q_u8, \a_tmp1, 2 + 4 * \sel4_q_u8
    mul \a_tmp0, \a_tmp0, \a_tmp1
    esp.movi.32.q \qd, \a_tmp0, 2

    esp.movi.32.a \q_u32, \a_tmp0, 3
    esp.movi.8.a \q_u8, \a_tmp1, 3 + 4 * \sel4_q_u8
    mul \a_tmp0, \a_tmp0, \a_tmp1
    esp.movi.32.q \qd, \a_tmp0, 3

    esp.vadd.u32 \qd, \qd, \q_round_delta
    esp.vsr.u32 \qd, \qd
.endm

.macro cal_s qd, q_vmax, q_diff, q_round_delta, a_sdiv_lut, q_tmp0, q_tmp1, a_tmp0, a_tmp1
    li \a_tmp0, 12
    esp.movx.w.sar \a_tmp0
    esp.vext.u8 \q_vmax, \q_tmp0, \q_vmax

    esp.ldxq.32 \q_tmp1, \q_vmax, \a_sdiv_lut, 0, 0
    esp.ldxq.32 \q_tmp1, \q_vmax, \a_sdiv_lut, 1, 1
    esp.ldxq.32 \q_tmp1, \q_vmax, \a_sdiv_lut, 2, 2
    esp.ldxq.32 \q_tmp1, \q_vmax, \a_sdiv_lut, 3, 3
    mul_u32xu8_round_and_shift \qd, \q_tmp1, \q_diff, \q_round_delta, \a_tmp0, \a_tmp1, 0

    esp.ldxq.32 \q_tmp1, \q_vmax, \a_sdiv_lut, 0, 4
    esp.ldxq.32 \q_tmp1, \q_vmax, \a_sdiv_lut, 1, 5
    esp.ldxq.32 \q_tmp1, \q_vmax, \a_sdiv_lut, 2, 6
    esp.ldxq.32 \q_tmp1, \q_vmax, \a_sdiv_lut, 3, 7
    mul_u32xu8_round_and_shift \q_vmax, \q_tmp1, \q_diff, \q_round_delta, \a_tmp0, \a_tmp1, 1

    esp.vunzip.16 \qd, \q_vmax

    esp.ldxq.32 \q_tmp1, \q_tmp0, \a_sdiv_lut, 0, 0
    esp.ldxq.32 \q_tmp1, \q_tmp0, \a_sdiv_lut, 1, 1
    esp.ldxq.32 \q_tmp1, \q_tmp0, \a_sdiv_lut, 2, 2
    esp.ldxq.32 \q_tmp1, \q_tmp0, \a_sdiv_lut, 3, 3
    mul_u32xu8_round_and_shift \q_vmax, \q_tmp1, \q_diff, \q_round_delta, \a_tmp0, \a_tmp1, 2

    esp.ldxq.32 \q_tmp1, \q_tmp0, \a_sdiv_lut, 0, 4
    esp.ldxq.32 \q_tmp1, \q_tmp0, \a_sdiv_lut, 1, 5
    esp.ldxq.32 \q_tmp1, \q_tmp0, \a_sdiv_lut, 2, 6
    esp.ldxq.32 \q_tmp1, \q_tmp0, \a_sdiv_lut, 3, 7
    mul_u32xu8_round_and_shift \q_tmp0, \q_tmp1, \q_diff, \q_round_delta, \a_tmp0, \a_tmp1, 3

    esp.vunzip.16 \q_vmax, \q_tmp0
    esp.vunzip.8 \qd, \q_vmax
.endm

.macro mul_s32xs32_round_and_shift qd, qs0, qs1, q_round_delta, a_tmp0, a_tmp1
    esp.movi.32.a \qs0, \a_tmp0, 0
    esp.movi.32.a \qs1, \a_tmp1, 0
    mul \a_tmp0, \a_tmp0, \a_tmp1
    esp.movi.32.q \qd, \a_tmp0, 0

    esp.movi.32.a \qs0, \a_tmp0, 1
    esp.movi.32.a \qs1, \a_tmp1, 1
    mul \a_tmp0, \a_tmp0, \a_tmp1
    esp.movi.32.q \qd, \a_tmp0, 1

    esp.movi.32.a \qs0, \a_tmp0, 2
    esp.movi.32.a \qs1, \a_tmp1, 2
    mul \a_tmp0, \a_tmp0, \a_tmp1
    esp.movi.32.q \qd, \a_tmp0, 2

    esp.movi.32.a \qs0, \a_tmp0, 3
    esp.movi.32.a \qs1, \a_tmp1, 3
    mul \a_tmp0, \a_tmp0, \a_tmp1
    esp.movi.32.q \qd, \a_tmp0, 3

    esp.vadd.s32 \qd, \qd, \q_round_delta
    esp.vsr.s32 \qd, \qd
.endm

.macro cal_h_helper qd, q_h, q_diff, q_round_delta, a_hdiv_lut, q_tmp0, q_tmp1, a_tmp0, a_tmp1
    esp.vext.s16 \q_h, \q_tmp0, \q_h

    esp.ldxq.32 \q_tmp1, \q_diff, \a_hdiv_lut, 0, 0
    esp.ldxq.32 \q_tmp1, \q_diff, \a_hdiv_lut, 1, 1
    esp.ldxq.32 \q_tmp1, \q_diff, \a_hdiv_lut, 2, 2
    esp.ldxq.32 \q_tmp1, \q_diff, \a_hdiv_lut, 3, 3
    mul_s32xs32_round_and_shift \qd, \q_h, \q_tmp1, \q_round_delta, \a_tmp0, \a_tmp1

    esp.ldxq.32 \q_tmp1, \q_diff, \a_hdiv_lut, 0, 4
    esp.ldxq.32 \q_tmp1, \q_diff, \a_hdiv_lut, 1, 5
    esp.ldxq.32 \q_tmp1, \q_diff, \a_hdiv_lut, 2, 6
    esp.ldxq.32 \q_tmp1, \q_diff, \a_hdiv_lut, 3, 7
    mul_s32xs32_round_and_shift \q_h, \q_tmp0, \q_tmp1, \q_round_delta, \a_tmp0, \a_tmp1

    esp.vunzip.16 \qd, \q_h
.endm

.macro rgb8882hsv qd0, qd1, qd2, a_sdiv_lut, a_hdiv_lut, qs0, qs1, qs2, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1
    addi sp, sp, -144
    addi \a_tmp0, sp, 0
    esp.vmax.u8 \qd0, \qs0, \qs1
    esp.vmax.u8 \qd0, \qd0, \qs2
    esp.vmin.u8 \qd2, \qs0, \qs1
    esp.vmin.u8 \qd2, \qd2, \qs2
    esp.vsub.u8 \qd2, \qd0, \qd2
    esp.vst.128.ip \qd0, \a_tmp0, 16
    esp.vst.128.ip \qd2, \a_tmp0, 16

    esp.vcmp.eq.u8 \q_tmp0, \qd0, \qs0
    esp.vst.128.ip \q_tmp0, \a_tmp0, 16
    esp.notq \q_tmp0, \q_tmp0
    esp.vcmp.eq.u8 \q_tmp1, \qd0, \qs1
    esp.andq \q_tmp1, \q_tmp1, \q_tmp0
    esp.vst.128.ip \q_tmp1, \a_tmp0, 16
    esp.notq \q_tmp1, \q_tmp1
    esp.andq \q_tmp1, \q_tmp0, \q_tmp1
    esp.vst.128.ip \q_tmp1, \a_tmp0, 16

    esp.vst.128.ip \qs0, \a_tmp0, 16
    esp.vst.128.ip \qs1, \a_tmp0, 16
    esp.vst.128.ip \qs2, \a_tmp0, 16

    la \a_tmp1, rgb8882hsv_const_tab
    esp.vldbc.32.ip \q_tmp0, \a_tmp1, 0

    cal_s \qd1, \qd0, \qd2, \q_tmp0, \a_sdiv_lut, \q_tmp1, \qs0, \a_tmp2, \a_tmp3
    esp.vst.128.ip \qd1, \a_tmp0, -48

    esp.vldext.u8.ip \qs0, \q_tmp0, \a_tmp0, 16
    esp.vldext.u8.ip \qs1, \q_tmp0, \a_tmp0, 16
    esp.vldext.u8.ip \qs2, \q_tmp0, \a_tmp0, -96

    # diff
    esp.vldext.u8.ip \qd1, \q_tmp0, \a_tmp0, 16

    # mask1
    esp.vldext.s8.ip \q_tmp0, \q_tmp1, \a_tmp0, 16
    esp.vsub.s16 \q_tmp1, \qs1, \qs2
    esp.andq \qd0, \q_tmp0, \q_tmp1

    # mask2
    esp.vldext.s8.ip \q_tmp0, \q_tmp1, \a_tmp0, 16
    vsl_16 \qd2, \qd1, \q_tmp1, \a_tmp2, 1
    esp.vsub.s16 \q_tmp1, \qs2, \qs0
    esp.vadd.s16 \q_tmp1, \q_tmp1, \qd2
    esp.andq \q_tmp0, \q_tmp0, \q_tmp1
    esp.vadd.s16 \qd0, \qd0, \q_tmp0

    # mask3
    esp.vldext.s8.ip \q_tmp0, \q_tmp1, \a_tmp0, 16
    vsl_16 \qd2, \qd1, \q_tmp1, \a_tmp2, 2
    esp.vsub.s16 \q_tmp1, \qs0, \qs1
    esp.vadd.s16 \q_tmp1, \q_tmp1, \qd2
    esp.andq \q_tmp0, \q_tmp0, \q_tmp1
    esp.vadd.s16 \qd0, \qd0, \q_tmp0

    esp.vldbc.32.ip \q_tmp0, \a_tmp1, 0
    cal_h_helper \qd2, \qd0, \qd1, \q_tmp0, \a_hdiv_lut, \q_tmp1, \qs0, \a_tmp2, \a_tmp3

    esp.vldext.u8.ip \q_tmp0, \qs0, \a_tmp0, 16
    esp.vldext.u8.ip \q_tmp0, \qs1, \a_tmp0, 16
    esp.vldext.u8.ip \q_tmp0, \qs2, \a_tmp0, -32
    esp.vst.128.ip \qd2, \a_tmp0, -64

