espressif/esp-dl/esp-dl/vision/image/isa/esp32p4/dl_esp32p4_color_common.S
    # diff
    esp.vldext.u8.ip \q_tmp0, \qd1, \a_tmp0, 16

    # mask1
    esp.vldext.s8.ip \q_tmp1, \q_tmp0, \a_tmp0, 16
    esp.vsub.s16 \q_tmp1, \qs1, \qs2
    esp.andq \qd0, \q_tmp0, \q_tmp1

    # mask2
    esp.vldext.s8.ip \q_tmp1, \q_tmp0, \a_tmp0, 16
    vsl_16 \qd2, \qd1, \q_tmp1, \a_tmp2, 1
    esp.vsub.s16 \q_tmp1, \qs2, \qs0
    esp.vadd.s16 \q_tmp1, \q_tmp1, \qd2
    esp.andq \q_tmp0, \q_tmp0, \q_tmp1
    esp.vadd.s16 \qd0, \qd0, \q_tmp0

    # mask3
    esp.vldext.s8.ip \q_tmp1, \q_tmp0, \a_tmp0, 16
    vsl_16 \qd2, \qd1, \q_tmp1, \a_tmp2, 2
    esp.vsub.s16 \q_tmp1, \qs0, \qs1
    esp.vadd.s16 \q_tmp1, \q_tmp1, \qd2
    esp.andq \q_tmp0, \q_tmp0, \q_tmp1
    esp.vadd.s16 \qd0, \qd0, \q_tmp0

    esp.vldbc.32.ip \q_tmp0, \a_tmp1, 4
    cal_h_helper \qs1, \qd0, \qd1, \q_tmp0, \a_hdiv_lut, \q_tmp1, \qs0, \a_tmp2, \a_tmp3

    vldbc_16_ip \q_tmp0, \a_tmp1, 0
    esp.vld.128.ip \qs0, \a_tmp0, 48
    esp.zero.q \q_tmp1
    esp.vcmp.lt.s16 \qd0, \qs0, \q_tmp1
    esp.andq \qd0, \qd0, \q_tmp0
    esp.vadd.s16 \qd0, \qd0, \qs0

    esp.vcmp.lt.s16 \qd1, \qs1, \q_tmp1
    esp.andq \qd1, \qd1, \q_tmp0
    esp.vadd.s16 \qd1, \qd1, \qs1
    esp.vunzip.8 \qd0, \qd1
    esp.vld.128.ip \qd1, \a_tmp0, -128
    esp.vld.128.ip \qd2, \a_tmp0, 0

    addi sp, sp, 144
.endm

.macro bgr8882hsv qd0, qd1, qd2, a_sdiv_lut, a_hdiv_lut, qs0, qs1, qs2, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1
    rgb8882hsv \qd0, \qd1, \qd2, \a_sdiv_lut, \a_hdiv_lut, \qs2, \qs1, \qs0, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp0, \q_tmp1
.endm

.macro rgb565le2hsv qd0, qd1, qd2, a_sdiv_lut, a_hdiv_lut, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2
    rgb5652rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv \qd0, \qd1, \qd2, \a_sdiv_lut, \a_hdiv_lut, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \qs0, \qs1
.endm

.macro rgb565be2hsv qd0, qd1, qd2, a_sdiv_lut, a_hdiv_lut, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2
    rgb5652rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs1, \qs0, \a_tmp0, \a_tmp1
    rgb8882hsv \qd0, \qd1, \qd2, \a_sdiv_lut, \a_hdiv_lut, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \qs0, \qs1
.endm

.macro bgr565le2hsv qd0, qd1, qd2, a_sdiv_lut, a_hdiv_lut, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2
    rgb5652rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv \qd0, \qd1, \qd2, \a_sdiv_lut, \a_hdiv_lut, \q_tmp2, \q_tmp1, \q_tmp0, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \qs0, \qs1
.endm

.macro bgr565be2hsv qd0, qd1, qd2, a_sdiv_lut, a_hdiv_lut, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2
    rgb5652rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs1, \qs0, \a_tmp0, \a_tmp1
    rgb8882hsv \qd0, \qd1, \qd2, \a_sdiv_lut, \a_hdiv_lut, \q_tmp2, \q_tmp1, \q_tmp0, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \qs0, \qs1
.endm

.macro hsv2hsv_mask qd, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, qs2, q_tmp, h_across_zero
    # h < h_min
    vldbc_8_ip \q_tmp, \a_hsv_min_addr, 1
    esp.vcmp.lt.u8 \qd, \qs0, \q_tmp
    # h > h_max
    vldbc_8_ip \q_tmp, \a_hsv_max_addr, 1
    esp.vcmp.gt.u8 \q_tmp, \qs0, \q_tmp
    .if \h_across_zero == 0
        esp.orq \qd, \qd, \q_tmp
    .elseif \h_across_zero == 1
        esp.andq \qd, \qd, \q_tmp
    .else
        .error "h_across_zero can only be 0/1."
    .endif
    # s < s_min
    vldbc_8_ip \q_tmp, \a_hsv_min_addr, 1
    esp.vcmp.lt.u8 \q_tmp, \qs1, \q_tmp
    esp.orq \qd, \qd, \q_tmp
    # s > s_max
    vldbc_8_ip \q_tmp, \a_hsv_max_addr, 1
    esp.vcmp.gt.u8 \q_tmp, \qs1, \q_tmp
    esp.orq \qd, \qd, \q_tmp
    # v < v_min
    vldbc_8_ip \q_tmp, \a_hsv_min_addr, -2
    esp.vcmp.lt.u8 \q_tmp, \qs2, \q_tmp
    esp.orq \qd, \qd, \q_tmp
    # v > v_max
    vldbc_8_ip \q_tmp, \a_hsv_max_addr, -2
    esp.vcmp.gt.u8 \q_tmp, \qs2, \q_tmp
    esp.orq \qd, \qd, \q_tmp
    esp.notq \qd, \qd
.endm

.macro hsv2hsv_mask0 qd, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, qs2, q_tmp
    hsv2hsv_mask \qd, \a_hsv_min_addr, \a_hsv_max_addr, \qs0, \qs1, \qs2, \q_tmp, 0
.endm

.macro hsv2hsv_mask1 qd, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, qs2, q_tmp
    hsv2hsv_mask \qd, \a_hsv_min_addr, \a_hsv_max_addr, \qs0, \qs1, \qs2, \q_tmp, 1
.endm

.macro rgb8882hsv_mask0 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, qs2, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    rgb8882hsv \q_tmp0, \q_tmp1, \q_tmp2, \a_sdiv_lut, \a_hdiv_lut, \qs0, \qs1, \qs2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \qd
    hsv2hsv_mask0 \qd, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
.endm

.macro rgb8882hsv_mask1 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, qs2, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    rgb8882hsv \q_tmp0, \q_tmp1, \q_tmp2, \a_sdiv_lut, \a_hdiv_lut, \qs0, \qs1, \qs2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \qd
    hsv2hsv_mask1 \qd, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
.endm

.macro bgr8882hsv_mask0 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, qs2, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    bgr8882hsv \q_tmp0, \q_tmp1, \q_tmp2, \a_sdiv_lut, \a_hdiv_lut, \qs0, \qs1, \qs2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \qd
    hsv2hsv_mask0 \qd, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
.endm

.macro bgr8882hsv_mask1 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, qs2, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3
    bgr8882hsv \q_tmp0, \q_tmp1, \q_tmp2, \a_sdiv_lut, \a_hdiv_lut, \qs0, \qs1, \qs2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \qd
    hsv2hsv_mask1 \qd, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \q_tmp3
.endm

.macro rgb565le2hsv_mask0 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565le2rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv_mask0 \qd, \a_sdiv_lut, \a_hdiv_lut, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

.macro rgb565le2hsv_mask1 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565le2rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv_mask1 \qd, \a_sdiv_lut, \a_hdiv_lut, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

.macro rgb565be2hsv_mask0 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565be2rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv_mask0 \qd, \a_sdiv_lut, \a_hdiv_lut, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

.macro rgb565be2hsv_mask1 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565be2rgb888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv_mask1 \qd, \a_sdiv_lut, \a_hdiv_lut, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

.macro bgr565le2hsv_mask0 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565le2bgr888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv_mask0 \qd, \a_sdiv_lut, \a_hdiv_lut, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

