espressif/esp-dl/esp-dl/vision/image/isa/esp32p4/dl_esp32p4_color_common.S
.macro bgr565le2hsv_mask1 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565le2bgr888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv_mask1 \qd, \a_sdiv_lut, \a_hdiv_lut, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

.macro bgr565be2hsv_mask0 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565be2bgr888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv_mask0 \qd, \a_sdiv_lut, \a_hdiv_lut, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

.macro bgr565be2hsv_mask1 qd, a_sdiv_lut, a_hdiv_lut, a_hsv_min_addr, a_hsv_max_addr, qs0, qs1, a_tmp0, a_tmp1, a_tmp2, a_tmp3, q_tmp0, q_tmp1, q_tmp2, q_tmp3, q_tmp4
    rgb565be2bgr888 \q_tmp0, \q_tmp1, \q_tmp2, \qs0, \qs1, \a_tmp0, \a_tmp1
    rgb8882hsv_mask1 \qd, \a_sdiv_lut, \a_hdiv_lut, \a_hsv_min_addr, \a_hsv_max_addr, \q_tmp0, \q_tmp1, \q_tmp2, \a_tmp0, \a_tmp1, \a_tmp2, \a_tmp3, \q_tmp3, \q_tmp4, \qs0, \qs1
.endm

.macro resize_nn_load_1chn_128 qd, base_addr, offsets, q_tmp0, q_tmp1, q_tmp2, a_tmp0, a_tmp1, a_tmp2, a_tmp3
    esp.vldbc.32.ip \q_tmp0, \base_addr, 0
    esp.vld.128.ip \q_tmp1, \offsets, 16
    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp0, 0
    esp.movi.32.a \q_tmp1, \a_tmp1, 1
    esp.movi.32.a \q_tmp1, \a_tmp2, 2
    esp.movi.32.a \q_tmp1, \a_tmp3, 3
    lb \a_tmp0, 0(\a_tmp0)
    lb \a_tmp1, 0(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp2)
    lb \a_tmp3, 0(\a_tmp3)
    esp.movi.8.q \qd, \a_tmp0, 0
    esp.movi.8.q \qd, \a_tmp1, 1
    esp.movi.8.q \qd, \a_tmp2, 2
    esp.movi.8.q \qd, \a_tmp3, 3

    esp.vadd.u32.ld.incp \q_tmp1, \offsets, \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp0, 0
    esp.movi.32.a \q_tmp2, \a_tmp1, 1
    esp.movi.32.a \q_tmp2, \a_tmp2, 2
    esp.movi.32.a \q_tmp2, \a_tmp3, 3
    lb \a_tmp0, 0(\a_tmp0)
    lb \a_tmp1, 0(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp2)
    lb \a_tmp3, 0(\a_tmp3)
    esp.movi.8.q \qd, \a_tmp0, 4
    esp.movi.8.q \qd, \a_tmp1, 5
    esp.movi.8.q \qd, \a_tmp2, 6
    esp.movi.8.q \qd, \a_tmp3, 7

    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp0, 0
    esp.movi.32.a \q_tmp1, \a_tmp1, 1
    esp.movi.32.a \q_tmp1, \a_tmp2, 2
    esp.movi.32.a \q_tmp1, \a_tmp3, 3
    lb \a_tmp0, 0(\a_tmp0)
    lb \a_tmp1, 0(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp2)
    lb \a_tmp3, 0(\a_tmp3)
    esp.movi.8.q \qd, \a_tmp0, 8
    esp.movi.8.q \qd, \a_tmp1, 9
    esp.movi.8.q \qd, \a_tmp2, 10
    esp.movi.8.q \qd, \a_tmp3, 11

    esp.vadd.u32 \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp0, 0
    esp.movi.32.a \q_tmp2, \a_tmp1, 1
    esp.movi.32.a \q_tmp2, \a_tmp2, 2
    esp.movi.32.a \q_tmp2, \a_tmp3, 3
    lb \a_tmp0, 0(\a_tmp0)
    lb \a_tmp1, 0(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp2)
    lb \a_tmp3, 0(\a_tmp3)
    esp.movi.8.q \qd, \a_tmp0, 12
    esp.movi.8.q \qd, \a_tmp1, 13
    esp.movi.8.q \qd, \a_tmp2, 14
    esp.movi.8.q \qd, \a_tmp3, 15
.endm

.macro resize_nn_load_store_1chn_128 dst_addr, base_addr, offsets, q_tmp0, q_tmp1, q_tmp2, a_tmp0, a_tmp1, a_tmp2, a_tmp3
    esp.vldbc.32.ip \q_tmp0, \base_addr, 0
    esp.vld.128.ip \q_tmp1, \offsets, 16
    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp0, 0
    esp.movi.32.a \q_tmp1, \a_tmp1, 1
    esp.movi.32.a \q_tmp1, \a_tmp2, 2
    esp.movi.32.a \q_tmp1, \a_tmp3, 3
    lb \a_tmp0, 0(\a_tmp0)
    lb \a_tmp1, 0(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp2)
    lb \a_tmp3, 0(\a_tmp3)
    sb \a_tmp0, 0(\dst_addr)
    sb \a_tmp1, 1(\dst_addr)
    sb \a_tmp2, 2(\dst_addr)
    sb \a_tmp3, 3(\dst_addr)

    esp.vadd.u32.ld.incp \q_tmp1, \offsets, \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp0, 0
    esp.movi.32.a \q_tmp2, \a_tmp1, 1
    esp.movi.32.a \q_tmp2, \a_tmp2, 2
    esp.movi.32.a \q_tmp2, \a_tmp3, 3
    lb \a_tmp0, 0(\a_tmp0)
    lb \a_tmp1, 0(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp2)
    lb \a_tmp3, 0(\a_tmp3)
    sb \a_tmp0, 4(\dst_addr)
    sb \a_tmp1, 5(\dst_addr)
    sb \a_tmp2, 6(\dst_addr)
    sb \a_tmp3, 7(\dst_addr)

    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp0, 0
    esp.movi.32.a \q_tmp1, \a_tmp1, 1
    esp.movi.32.a \q_tmp1, \a_tmp2, 2
    esp.movi.32.a \q_tmp1, \a_tmp3, 3
    lb \a_tmp0, 0(\a_tmp0)
    lb \a_tmp1, 0(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp2)
    lb \a_tmp3, 0(\a_tmp3)
    sb \a_tmp0, 8(\dst_addr)
    sb \a_tmp1, 9(\dst_addr)
    sb \a_tmp2, 10(\dst_addr)
    sb \a_tmp3, 11(\dst_addr)

    esp.vadd.u32 \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp0, 0
    esp.movi.32.a \q_tmp2, \a_tmp1, 1
    esp.movi.32.a \q_tmp2, \a_tmp2, 2
    esp.movi.32.a \q_tmp2, \a_tmp3, 3
    lb \a_tmp0, 0(\a_tmp0)
    lb \a_tmp1, 0(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp2)
    lb \a_tmp3, 0(\a_tmp3)
    sb \a_tmp0, 12(\dst_addr)
    sb \a_tmp1, 13(\dst_addr)
    sb \a_tmp2, 14(\dst_addr)
    sb \a_tmp3, 15(\dst_addr)
    addi \dst_addr, \dst_addr, 16
.endm

.macro resize_nn_load_2chn_128 qd0, qd1, base_addr, offsets, q_tmp0, q_tmp1, q_tmp2, a_tmp0, a_tmp1, a_tmp2, a_tmp3
    esp.vldbc.32.ip \q_tmp0, \base_addr, 0
    esp.vld.128.ip \q_tmp1, \offsets, 16
    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp0, 0
    esp.movi.32.a \q_tmp1, \a_tmp1, 1
    esp.movi.32.a \q_tmp1, \a_tmp2, 2
    esp.movi.32.a \q_tmp1, \a_tmp3, 3
    lh \a_tmp0, 0(\a_tmp0)
    lh \a_tmp1, 0(\a_tmp1)
    lh \a_tmp2, 0(\a_tmp2)
    lh \a_tmp3, 0(\a_tmp3)
    esp.movi.16.q \qd0, \a_tmp0, 0
    esp.movi.16.q \qd0, \a_tmp1, 1
    esp.movi.16.q \qd0, \a_tmp2, 2
    esp.movi.16.q \qd0, \a_tmp3, 3

    esp.vadd.u32.ld.incp \q_tmp1, \offsets, \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp0, 0
    esp.movi.32.a \q_tmp2, \a_tmp1, 1
    esp.movi.32.a \q_tmp2, \a_tmp2, 2
    esp.movi.32.a \q_tmp2, \a_tmp3, 3
    lh \a_tmp0, 0(\a_tmp0)
    lh \a_tmp1, 0(\a_tmp1)
    lh \a_tmp2, 0(\a_tmp2)
    lh \a_tmp3, 0(\a_tmp3)
    esp.movi.16.q \qd0, \a_tmp0, 4
    esp.movi.16.q \qd0, \a_tmp1, 5
    esp.movi.16.q \qd0, \a_tmp2, 6
    esp.movi.16.q \qd0, \a_tmp3, 7

    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp0, 0
    esp.movi.32.a \q_tmp1, \a_tmp1, 1
    esp.movi.32.a \q_tmp1, \a_tmp2, 2
    esp.movi.32.a \q_tmp1, \a_tmp3, 3
    lh \a_tmp0, 0(\a_tmp0)
    lh \a_tmp1, 0(\a_tmp1)
    lh \a_tmp2, 0(\a_tmp2)
    lh \a_tmp3, 0(\a_tmp3)
    esp.movi.16.q \qd1, \a_tmp0, 0
    esp.movi.16.q \qd1, \a_tmp1, 1
    esp.movi.16.q \qd1, \a_tmp2, 2
    esp.movi.16.q \qd1, \a_tmp3, 3

    esp.vadd.u32 \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp0, 0
    esp.movi.32.a \q_tmp2, \a_tmp1, 1
    esp.movi.32.a \q_tmp2, \a_tmp2, 2
    esp.movi.32.a \q_tmp2, \a_tmp3, 3
    lh \a_tmp0, 0(\a_tmp0)
    lh \a_tmp1, 0(\a_tmp1)
    lh \a_tmp2, 0(\a_tmp2)
    lh \a_tmp3, 0(\a_tmp3)
    esp.movi.16.q \qd1, \a_tmp0, 4
    esp.movi.16.q \qd1, \a_tmp1, 5
    esp.movi.16.q \qd1, \a_tmp2, 6
    esp.movi.16.q \qd1, \a_tmp3, 7
.endm

.macro resize_nn_load_store_2chn_128 dst_addr, base_addr, offsets, q_tmp0, q_tmp1, q_tmp2, a_tmp0, a_tmp1, a_tmp2, a_tmp3
    esp.vldbc.32.ip \q_tmp0, \base_addr, 0
    esp.vld.128.ip \q_tmp1, \offsets, 16
    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp0, 0
    esp.movi.32.a \q_tmp1, \a_tmp1, 1
    esp.movi.32.a \q_tmp1, \a_tmp2, 2
    esp.movi.32.a \q_tmp1, \a_tmp3, 3
    lh \a_tmp0, 0(\a_tmp0)
    lh \a_tmp1, 0(\a_tmp1)
    lh \a_tmp2, 0(\a_tmp2)
    lh \a_tmp3, 0(\a_tmp3)
    sh \a_tmp0, 0(\dst_addr)
    sh \a_tmp1, 2(\dst_addr)
    sh \a_tmp2, 4(\dst_addr)
    sh \a_tmp3, 6(\dst_addr)

    esp.vadd.u32.ld.incp \q_tmp1, \offsets, \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp0, 0
    esp.movi.32.a \q_tmp2, \a_tmp1, 1
    esp.movi.32.a \q_tmp2, \a_tmp2, 2
    esp.movi.32.a \q_tmp2, \a_tmp3, 3
    lh \a_tmp0, 0(\a_tmp0)
    lh \a_tmp1, 0(\a_tmp1)
    lh \a_tmp2, 0(\a_tmp2)
    lh \a_tmp3, 0(\a_tmp3)
    sh \a_tmp0, 8(\dst_addr)
    sh \a_tmp1, 10(\dst_addr)
    sh \a_tmp2, 12(\dst_addr)
    sh \a_tmp3, 14(\dst_addr)

    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp0, 0
    esp.movi.32.a \q_tmp1, \a_tmp1, 1
    esp.movi.32.a \q_tmp1, \a_tmp2, 2
    esp.movi.32.a \q_tmp1, \a_tmp3, 3
    lh \a_tmp0, 0(\a_tmp0)
    lh \a_tmp1, 0(\a_tmp1)
    lh \a_tmp2, 0(\a_tmp2)
    lh \a_tmp3, 0(\a_tmp3)
    sh \a_tmp0, 16(\dst_addr)
    sh \a_tmp1, 18(\dst_addr)
    sh \a_tmp2, 20(\dst_addr)
    sh \a_tmp3, 22(\dst_addr)

    esp.vadd.u32 \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp0, 0
    esp.movi.32.a \q_tmp2, \a_tmp1, 1
    esp.movi.32.a \q_tmp2, \a_tmp2, 2
    esp.movi.32.a \q_tmp2, \a_tmp3, 3
    lh \a_tmp0, 0(\a_tmp0)
    lh \a_tmp1, 0(\a_tmp1)
    lh \a_tmp2, 0(\a_tmp2)
    lh \a_tmp3, 0(\a_tmp3)
    sh \a_tmp0, 24(\dst_addr)
    sh \a_tmp1, 26(\dst_addr)
    sh \a_tmp2, 28(\dst_addr)
    sh \a_tmp3, 30(\dst_addr)
    addi \dst_addr, \dst_addr, 32
.endm

