espressif/esp-dl/esp-dl/vision/image/isa/esp32p4/dl_esp32p4_color_common.S
.macro resize_nn_load_3chn_128 qd0, qd1, qd2, base_addr, offsets, q_tmp0, q_tmp1, q_tmp2, a_tmp0, a_tmp1, a_tmp2, a_tmp3, a_tmp4, a_tmp5, a_tmp6, a_tmp7
    esp.vldbc.32.ip \q_tmp0, \base_addr, 0
    esp.vld.128.ip \q_tmp1, \offsets, 16
    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp1, 0
    esp.movi.32.a \q_tmp1, \a_tmp3, 1
    esp.movi.32.a \q_tmp1, \a_tmp5, 2
    esp.movi.32.a \q_tmp1, \a_tmp7, 3
    lh \a_tmp0, 0(\a_tmp1)
    lb \a_tmp1, 2(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp3)
    lh \a_tmp3, 1(\a_tmp3)
    lh \a_tmp4, 0(\a_tmp5)
    lb \a_tmp5, 2(\a_tmp5)
    lb \a_tmp6, 0(\a_tmp7)
    lh \a_tmp7, 1(\a_tmp7)
    esp.movi.16.q \qd0, \a_tmp0, 0
    esp.movi.8.q  \qd0, \a_tmp1, 2
    esp.movi.8.q  \qd0, \a_tmp2, 3
    esp.movi.16.q \qd0, \a_tmp3, 2
    esp.movi.16.q \qd0, \a_tmp4, 3
    esp.movi.8.q  \qd0, \a_tmp5, 8
    esp.movi.8.q  \qd0, \a_tmp6, 9
    esp.movi.16.q \qd0, \a_tmp7, 5

    esp.vadd.u32.ld.incp \q_tmp1, \offsets, \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp1, 0
    esp.movi.32.a \q_tmp2, \a_tmp3, 1
    esp.movi.32.a \q_tmp2, \a_tmp5, 2
    esp.movi.32.a \q_tmp2, \a_tmp7, 3
    lh \a_tmp0, 0(\a_tmp1)
    lb \a_tmp1, 2(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp3)
    lh \a_tmp3, 1(\a_tmp3)
    lh \a_tmp4, 0(\a_tmp5)
    lb \a_tmp5, 2(\a_tmp5)
    lb \a_tmp6, 0(\a_tmp7)
    lh \a_tmp7, 1(\a_tmp7)
    esp.movi.16.q \qd0, \a_tmp0, 6
    esp.movi.8.q  \qd0, \a_tmp1, 14
    esp.movi.8.q  \qd0, \a_tmp2, 15
    esp.movi.16.q \qd1, \a_tmp3, 0
    esp.movi.16.q \qd1, \a_tmp4, 1
    esp.movi.8.q  \qd1, \a_tmp5, 4
    esp.movi.8.q  \qd1, \a_tmp6, 5
    esp.movi.16.q \qd1, \a_tmp7, 3

    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp1, 0
    esp.movi.32.a \q_tmp1, \a_tmp3, 1
    esp.movi.32.a \q_tmp1, \a_tmp5, 2
    esp.movi.32.a \q_tmp1, \a_tmp7, 3
    lh \a_tmp0, 0(\a_tmp1)
    lb \a_tmp1, 2(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp3)
    lh \a_tmp3, 1(\a_tmp3)
    lh \a_tmp4, 0(\a_tmp5)
    lb \a_tmp5, 2(\a_tmp5)
    lb \a_tmp6, 0(\a_tmp7)
    lh \a_tmp7, 1(\a_tmp7)
    esp.movi.16.q \qd1, \a_tmp0, 4
    esp.movi.8.q  \qd1, \a_tmp1, 10
    esp.movi.8.q  \qd1, \a_tmp2, 11
    esp.movi.16.q \qd1, \a_tmp3, 6
    esp.movi.16.q \qd1, \a_tmp4, 7
    esp.movi.8.q  \qd2, \a_tmp5, 0
    esp.movi.8.q  \qd2, \a_tmp6, 1
    esp.movi.16.q \qd2, \a_tmp7, 1

    esp.vadd.u32 \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp1, 0
    esp.movi.32.a \q_tmp2, \a_tmp3, 1
    esp.movi.32.a \q_tmp2, \a_tmp5, 2
    esp.movi.32.a \q_tmp2, \a_tmp7, 3
    lh \a_tmp0, 0(\a_tmp1)
    lb \a_tmp1, 2(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp3)
    lh \a_tmp3, 1(\a_tmp3)
    lh \a_tmp4, 0(\a_tmp5)
    lb \a_tmp5, 2(\a_tmp5)
    lb \a_tmp6, 0(\a_tmp7)
    lh \a_tmp7, 1(\a_tmp7)
    esp.movi.16.q \qd2, \a_tmp0, 2
    esp.movi.8.q  \qd2, \a_tmp1, 6
    esp.movi.8.q  \qd2, \a_tmp2, 7
    esp.movi.16.q \qd2, \a_tmp3, 4
    esp.movi.16.q \qd2, \a_tmp4, 5
    esp.movi.8.q  \qd2, \a_tmp5, 12
    esp.movi.8.q  \qd2, \a_tmp6, 13
    esp.movi.16.q \qd2, \a_tmp7, 7
.endm

.macro resize_nn_load_store_3chn_128 dst_addr, base_addr, offsets, q_tmp0, q_tmp1, q_tmp2, a_tmp0, a_tmp1, a_tmp2, a_tmp3, a_tmp4, a_tmp5, a_tmp6, a_tmp7
    esp.vldbc.32.ip \q_tmp0, \base_addr, 0
    esp.vld.128.ip \q_tmp1, \offsets, 16
    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp1, 0
    esp.movi.32.a \q_tmp1, \a_tmp3, 1
    esp.movi.32.a \q_tmp1, \a_tmp5, 2
    esp.movi.32.a \q_tmp1, \a_tmp7, 3
    lh \a_tmp0, 0(\a_tmp1)
    lb \a_tmp1, 2(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp3)
    lh \a_tmp3, 1(\a_tmp3)
    lh \a_tmp4, 0(\a_tmp5)
    lb \a_tmp5, 2(\a_tmp5)
    lb \a_tmp6, 0(\a_tmp7)
    lh \a_tmp7, 1(\a_tmp7)
    sh \a_tmp0, 0(\dst_addr)
    sb \a_tmp1, 2(\dst_addr)
    sb \a_tmp2, 3(\dst_addr)
    sh \a_tmp3, 4(\dst_addr)
    sh \a_tmp4, 6(\dst_addr)
    sb \a_tmp5, 8(\dst_addr)
    sb \a_tmp6, 9(\dst_addr)
    sh \a_tmp7, 10(\dst_addr)

    esp.vadd.u32.ld.incp \q_tmp1, \offsets, \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp1, 0
    esp.movi.32.a \q_tmp2, \a_tmp3, 1
    esp.movi.32.a \q_tmp2, \a_tmp5, 2
    esp.movi.32.a \q_tmp2, \a_tmp7, 3
    lh \a_tmp0, 0(\a_tmp1)
    lb \a_tmp1, 2(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp3)
    lh \a_tmp3, 1(\a_tmp3)
    lh \a_tmp4, 0(\a_tmp5)
    lb \a_tmp5, 2(\a_tmp5)
    lb \a_tmp6, 0(\a_tmp7)
    lh \a_tmp7, 1(\a_tmp7)
    sh \a_tmp0, 12(\dst_addr)
    sb \a_tmp1, 14(\dst_addr)
    sb \a_tmp2, 15(\dst_addr)
    sh \a_tmp3, 16(\dst_addr)
    sh \a_tmp4, 18(\dst_addr)
    sb \a_tmp5, 20(\dst_addr)
    sb \a_tmp6, 21(\dst_addr)
    sh \a_tmp7, 22(\dst_addr)

    esp.vadd.u32.ld.incp \q_tmp2, \offsets, \q_tmp1, \q_tmp0, \q_tmp1
    esp.movi.32.a \q_tmp1, \a_tmp1, 0
    esp.movi.32.a \q_tmp1, \a_tmp3, 1
    esp.movi.32.a \q_tmp1, \a_tmp5, 2
    esp.movi.32.a \q_tmp1, \a_tmp7, 3
    lh \a_tmp0, 0(\a_tmp1)
    lb \a_tmp1, 2(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp3)
    lh \a_tmp3, 1(\a_tmp3)
    lh \a_tmp4, 0(\a_tmp5)
    lb \a_tmp5, 2(\a_tmp5)
    lb \a_tmp6, 0(\a_tmp7)
    lh \a_tmp7, 1(\a_tmp7)
    sh \a_tmp0, 24(\dst_addr)
    sb \a_tmp1, 26(\dst_addr)
    sb \a_tmp2, 27(\dst_addr)
    sh \a_tmp3, 28(\dst_addr)
    sh \a_tmp4, 30(\dst_addr)
    sb \a_tmp5, 32(\dst_addr)
    sb \a_tmp6, 33(\dst_addr)
    sh \a_tmp7, 34(\dst_addr)

    esp.vadd.u32 \q_tmp2, \q_tmp0, \q_tmp2
    esp.movi.32.a \q_tmp2, \a_tmp1, 0
    esp.movi.32.a \q_tmp2, \a_tmp3, 1
    esp.movi.32.a \q_tmp2, \a_tmp5, 2
    esp.movi.32.a \q_tmp2, \a_tmp7, 3
    lh \a_tmp0, 0(\a_tmp1)
    lb \a_tmp1, 2(\a_tmp1)
    lb \a_tmp2, 0(\a_tmp3)
    lh \a_tmp3, 1(\a_tmp3)
    lh \a_tmp4, 0(\a_tmp5)
    lb \a_tmp5, 2(\a_tmp5)
    lb \a_tmp6, 0(\a_tmp7)
    lh \a_tmp7, 1(\a_tmp7)
    sh \a_tmp0, 36(\dst_addr)
    sb \a_tmp1, 38(\dst_addr)
    sb \a_tmp2, 39(\dst_addr)
    sh \a_tmp3, 40(\dst_addr)
    sh \a_tmp4, 42(\dst_addr)
    sb \a_tmp5, 44(\dst_addr)
    sb \a_tmp6, 45(\dst_addr)
    sh \a_tmp7, 46(\dst_addr)
    addi \dst_addr, \dst_addr, 48
.endm
